<!-- ━━━━━━━━━ JS | TS ━━━━━━━━━ -->
<script>
	'use strict'// CHECKS TYPES

	/**: - ©MEMBER-PROPERTIES| */
	/*| #™━━━━━━━━━━━━━━━━━━━━━|*/

	/*| #™━━━━━━━━━━━━━━━━━━━━━|*/

	/**| ™- LABELED-STATEMENT |*/
	/* #™━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ */

	/* #™━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ */

	/** #™━━━━━━━━━━━━━━━━━━━ FUNCTION ━━━━━━━━━━━━━━━━━━━ */
</script>
<!-- ⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️🔵🔵🔵🔵🔵🔵🔵🔵━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ -->

<div class="container">
	<!-- ━━━━━━━━━━━━━━━ CONTAINER ━━━━━━━━━━━━━━━ -->
	<!--⌛-->

	<!--⌨⌨⌨⌨|Nav-Bar|⌨⌨⌨⌨-->
	<header>
		<nav class="nav">
			<div class="nav-center">
				<!-- Nav-Title -->
				<h1 class="nav-title">
					<span class="title">Budget Calculator
					</span>
				</h1>

				<!-- Nav-Button -->
				<button type="button" class="nav-btn">
					<span class="plus-txt">
					<i class="far fa-plus-square"></i>
					Add Item
				</span>
				</button>
			</div>


		</nav>
	</header>
	<!--⌨⌨⌨⌨⌨⌨|END|⌨⌨⌨⌨⌨⌨-->

	<!--⌛-->
	<!-- ━━━━━━━━━━━━━━━ CONTAINER ━━━━━━━━━━━━━━━ -->
</div>
<!-- ⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️🔵🔵🔵🔵🔵🔵🔵🔵━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ -->

<!-- ━━━━━━━━━ CSS | SCSS | SASS ━━━━━━━━━ -->
<style type="scss">
	@import 'src/styles/styles.scss';
	/* | ⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫ | */
	button {
		padding: 5px 18px;
		outline: none;
	}
	button:hover {
		color: black;
		opacity: 0.65;
	}
	button:active {
		opacity: 0;
	}
	/* | ⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫ | */
	.plus-txt {
		color: white;
		text-shadow: $contact-txt-shadow;
		opacity: 0.85;
	}
	.fa-plus-square {
		color: lightslategray;
		opacity: 0.9;
		margin-right: 6px;
	}
	.title {
		text-shadow: $contact-txt-shadow;
		opacity: 0.7;
	}
	/* | ⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫⌫ | */
</style>
<!-- ⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️🔵🔵🔵🔵🔵🔵🔵🔵━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ -->
